#include "stdint.h"

/*--------------------------------------------------------------------------------
 * BUTTONS_DebounceHandler (buttonState : uint16_t 	- сигнал с пина, к которому 
													  присоедена кнопка.
 *				   			buttonNumber : uint8_t   - номер кнопки.
 *				   			debounceLimit : uint32_t - лимит счетчика кнопки, после которого
													   она будет считаться гарантированно
													   нажатой.
 * 				   		    ) : uint8_t - условное состояние кнопки (нажата, не нажата)
 * Функция для программной обработки дребезга кнопки.
 *--------------------------------------------------------------------------------*/
uint8_t BUTTONS_DebounceHandler(uint16_t buttonState, uint8_t buttonNumber, uint32_t debounceLimit);