#include "delay.h"

#include "stdint.h"

volatile uint32_t msTicks;

/*--------------------------------------------------------------------------------
 * SysTick_Handler (void) : void
 * Обработчик, который считает количество тиков.
 *--------------------------------------------------------------------------------*/
void SysTick_Handler(void) {
  msTicks++;
}

/*----------------------------------------------------------------------------
 * DelayMicro (dlyTicks : uint32_t - количество тиков для задержки
 *			   ) : void
 * Функция для приостановки работы контроллера на нужное количество тиков.
 *----------------------------------------------------------------------------*/
void DelayMicro (uint32_t dlyTicks) {
  uint32_t curTicks;

  curTicks = msTicks;
  while ((msTicks - curTicks) < dlyTicks) { __NOP(); }
}
