#include "stm32f10x.h"
#include "I2C.h"

// Адрес дисплея
#define SSD1306_ADDRESS  0x78

/*--------------------------------------------------------------------------------
 * OLED_Init (void) : void
 * Функция для инициализации дисплея и его первоначальной настройки, после
 * выполнения настройки экран отчищается.
 *--------------------------------------------------------------------------------*/
void OLED_Init(void);

/*--------------------------------------------------------------------------------
 * OLED_WriteTime (hourTens : uint8_t 	 - десятки часов.
 *				   hourUnits : uint8_t   - единицы часов.
 *				   minuteTens : uint8_t  - десятки минут.
 * 				   minuteUnits : uint8_t - единицы минут.
 * 				   mode : uint8_t - режим работы будильника,
 *									0 - не будет отображаться,
 *									1 - SET TIME,
 *							    	2 - SET ALARM.
 * 				   highlightedNumber - номер подсвечиваемой цифры слева направо,
 *								       0 - не будет отображаться.
 * 				   ) : void
 * Вывод на экран информации, указанной в аргументах функции.
 *--------------------------------------------------------------------------------*/
void OLED_WriteTime(uint8_t hourTens, uint8_t hourUnits, uint8_t minuteTens, uint8_t minuteUnits, uint8_t mode, uint8_t highlightedNumber);