/*----------------------------------------------------------------
 * InitTIM3(void) : void
 * Функция для инициализации таймера общего назначения TIM3 и
 * включение обработчика прерываний.
 *----------------------------------------------------------------*/
void TIM3_Init(void);

/*----------------------------------------------------------------
 * InitTIM4(void) : void
 * Функция для инициализации таймера общего назначения TIM4 и
 * включение обработчика прерываний.
 *----------------------------------------------------------------*/
void TIM4_Init(void);